{"id":474,"date":"2016-04-20T19:25:27","date_gmt":"2016-04-20T11:25:27","guid":{"rendered":"http:\/\/wpunboxed.wpengine.com\/?page_id=474"},"modified":"2018-01-19T15:16:30","modified_gmt":"2018-01-19T07:16:30","slug":"tnc","status":"publish","type":"page","link":"https:\/\/unboxed.globalpsa.com\/tnc\/","title":{"rendered":"Terms and Conditions"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p><strong><u>Terms and Conditions for the PSA Incubator Program<\/u><\/strong><\/p>\n<ol>\n<li>This document (hereafter referred to as &#8220;<strong>Terms and Conditions<\/strong>&#8220;) sets out the terms and conditions under which the Applicant agrees to submit its proposal (hereinafter referred to as the “<strong>Innovation Application<\/strong>”), and provide further information and\/or clarification, for the purposes of being considered for the PSA unboXed Incubator Program (hereinafter referred to as the “<strong>Incubator Program<\/strong>”).<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"2\">\n<li>Definitions<\/li>\n<\/ol>\n<p style=\"padding-left: 30px;\">2.1     Unless the context otherwise requires:<\/p>\n<ul>\n<li>“<strong>Affiliates<\/strong>” means PSA’s related corporations and ‘related corporation’ shall have the same meaning as ascribed to it under the Singapore Companies Act (Chapter 50).<\/li>\n<li>“<strong>Applicant<\/strong>” means the person submitting the Innovation Application.<\/li>\n<li>&#8220;<strong>Information<\/strong>&#8221; means information of any nature, whether it be technical, commercial or economic, including but not limited to information on operations, processes, product information, know-how, designs, method, trade secrets, knowledge, prototype, specific component or software, whether protected or protectable by an intellectual property right, however recorded or preserved. The Information provided by the Applicant to PSA or its Affiliates through its Innovation Application or otherwise by way of further information or clarification, will not be protected by intellectual property rights if:<\/li>\n<li>on the date of the submission of the Innovation Application or subsequently thereafter, is in the public domain without any default by PSA and\/or its Affiliates;<\/li>\n<li>It was lawfully possessed by PSA and\/or its Affiliates or was disclosed by a third party to PSA and\/or its Affiliates;<\/li>\n<li>it is in possession of PSA and\/or its Affiliates prior to the disclosure; or<\/li>\n<li>it results from internal developments undertaken in good faith by the PSA without having preliminary access to the Information.<\/li>\n<li>“<strong>PSA<\/strong>” means PSA Unboxed Pte. Ltd.<\/li>\n<\/ul>\n<p style=\"padding-left: 30px;\">2.2     Reference to a ‘person’ includes reference to a legally registered or subsisting (as the case may) sole proprietor, partnership or company or other form of organization or individual who has reached the age of legal majority, as on the date of submission of the Innovation Application.<\/p>\n<p>&nbsp;<\/p>\n<ol start=\"3\">\n<li>For the protection and benefit of the Applicant, the Applicant must read and understand the Terms and Conditions before making the Innovation Application(s). By submitting the Innovation Application the Applicant shall be deemed to have accepted and agreed to be legally bound to these Terms and Conditions.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"4\">\n<li>It is recommended that before making the Innovation Application, the Applicant takes such steps (including obtaining advice) as it deems fit\/necessary to safeguard and protect the intellectual property rights of the Information that will be disclosed by the Applicant, in its Innovation Application and by way of further information or clarifications, to PSA and\/or its Affiliates.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"5\">\n<li>The Innovation Application should clearly and concisely detail the innovation. At this stage, as far as possible, when providing the Information in the Innovation Application, do not mention confidential information or limit the disclosure of confidential information. For avoidance of doubt, please note that PSA and\/or its Affiliates do not undertake any responsibility or obligation to keep confidential any information provided by the Applicant in respect of the Innovation Application. Should the Applicant be selected for th<span style=\"color: #000000;\">e Incubator Program<\/span> a confidentiality agreement may be signed with the Applicant at that stage. The Innovation Application should be in English.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"6\">\n<li>By submitting the Innovation Application, the Applicant:\n<ul>\n<li>guarantees that it has the power and\/or it has obtained the necessary authority to submit the Innovation Application to PSA;<\/li>\n<li>confirms that the contents of the Innovation Application are complete, true and accurate;<\/li>\n<li>represents and warrants that the Innovation Application does not infringe, and to the best of the Applicant’s knowledge will not infringe, the intellectual property or other rights or interest of any third party;<\/li>\n<li>represents and warrants that the Innovation Application does not breach, and to the best of the Applicant’s knowledge will not breach, the confidentiality, secret or other rights or interest of any third party; and<\/li>\n<li>represents and warrants that to the best of the Applicant’s knowledge the Innovation Application may not result in any other liability.<\/li>\n<\/ul>\n<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"7\">\n<li>PSA will notify the Applicant that has been shortlisted for being considered for the Incubator Program, of its interest in the Applicant’s Innovation Application. The method and\/or basis on which PSA reviews, judges, evaluates, decides and\/or selects the Innovation Application for being eligible for the Incubator Program is confidential. PSA shall not answer any requests for reasons, clarifications or enquiries in this regard, whether it is sought verbally or in writing.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"8\">\n<li>At PSA’s discretion, the successful Applicant will enter into written agreement(s) with PSA and\/or its Affiliates. The purpose of the written agreements would <em>inter alia<\/em> be to record the understanding and agreement between the parties of the terms and conditions of investment in the Applicant’s innovation, the status of intellectual property rights involved, terms of employment of the founder etc. Until the execution of the separate agreement(s) is completed or unless agreed otherwise, these Terms and Conditions shall continue to apply.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"9\">\n<li>The Applicant agrees to be bound by all of PSA’s decisions, instructions, rules, regulations, terms, conditions and procedures on any matter relating to the Incubator Program, including requirements to execute necessary documents such as undertakings, warranty, release and assignment documents.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"10\">\n<li>PSA and\/or its Affiliates may from time to time require the Applicant to participate in advertising, marketing, promotional and publicity activities (“<strong>Advertising Events<\/strong>”) undertaken by PSA and\/or its Affiliates in relation to the Incubator Program. The Applicant agrees to take part in any and all such Advertising Events. However, the Applicant shall at no point, without the prior written approval of PSA, communicate (whether written or oral), including making presentations, issuing statements, making comments, attending interviews, with any press, media or social media agencies on anything relating to the Incubator Program.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"11\">\n<li>The Applicant shall not disclose any information whatsoever relating to PSA and\/or its Affiliates to any party.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"12\">\n<li>PSA may at its discretion and without assigning any reasons, elect to discontinue, terminate postpone or suspend the Incubator Program and\/or any funding relating thereto at any stage without prior notice. In such an event, neither shall PSA and\/or its Affiliates be held liable, accountable or responsible to provide, procure or secure any funding for the Applicant by reason of any act done or omitted to be done by the Applicant on account of the Incubator Program.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"13\">\n<li>Nothing in these Terms and Conditions or participation by the Applicant in the Incubator Program shall create, or be deemed to create, a partnership or joint venture or the relationship of principal and agent or employer and employee between the Applicant and PSA and\/or its Affiliates.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"14\">\n<li>PSA and\/or the Affiliates shall not be liable or responsible for any losses, damages, costs and\/or expenses (of any nature whatsoever) suffered by the Applicant arising from any failure or refusal, for whatever reason, to make good on any promise or offer to the Applicant, including the grant of any funding.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"15\">\n<li>If the Applicant breaches any of its obligations under these Terms and Conditions, PSA shall, without prejudice to all other rights or remedies available to PSA, be entitled to disqualify the Applicant from the Incubator Program immediately. Thereafter, should PSA elect it may claw-back, withdraw, withhold and\/or forfeit any funding to the Applicant. Should PSA decide to claw-back on any or all the funding provided to the Applicant, it shall be refunded to PSA within twenty (20) days of receipt of PSA&#8217;s written demand by the Applicant.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"16\">\n<li>The Applicant is solely responsible for all costs and expenses incurred by the Applicant in relation to the Incubator Program including preparing and submitting the Innovation Application, attending interviews, meetings or discussions with PSA and execution of contracts. For the avoidance of doubt, PSA shall not assume or be required to bear, reimburse or make payment of whatsoever nature for any of the foregoing costs and expenses.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"17\">\n<li>With the submission of the Innovation Application, the Applicant is deemed to have consented to PSA and\/or its Affiliates collecting, using, disclosing, holding or otherwise processing your personal data, as provided to PSA in the Innovation Application and\/or further clarifications, as PSA deems fit for the purpose of the Incubator Program. PSA and \/or its Affiliates may use your personal data, amongst other things,:<\/li>\n<\/ol>\n<ul>\n<li>for verification of your identity;<\/li>\n<li>for conducting investigations;<\/li>\n<li>to communicate with you;<\/li>\n<li>to send you notifications and updates;<\/li>\n<li>to respond to your requests and queries;<\/li>\n<li>to allow you access to PSA facilities and premises;<\/li>\n<li>to conduct or arrange for trainings and courses;<\/li>\n<li>to protect the security and integrity of our website and our business;<\/li>\n<li>disclose your personal data to the relevant parties including business partners, third party service providers, governmental authorities, courts and other relevant third parties, whether in Singapore or overseas;<\/li>\n<li>using and\/or disclosing the your personal data for advertisement, publications and media productions; and<\/li>\n<li>for any other purposes for which we have obtained your consent, or for which you may be deemed to have provided consent.<\/li>\n<\/ul>\n<p style=\"padding-left: 30px;\">in respect of the above, the Applicant is requested to read PSA’s policy statement, explaining how its personal data will be handled by PSA, at <a href=\"https:\/\/www.singaporepsa.com\/personal-data-protection-act\">https:\/\/www.singaporepsa.com\/personal-data-protection-act<\/a>.<\/p>\n<ol start=\"18\">\n<li>With respect to paragraph 17, you agree to irrevocably release PSA from and against any and all claims, suits, liabilities, or damages which the Applicant may have in connection with your details being used by PSA (or any third party which PSA has released the particulars to in any manner or format or disclosed or otherwise provided by PSA to any third party as provided herein.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"19\">\n<li>The Applicant shall indemnify PSA and its Affiliates, employees, officers and agents against all liabilities, loss, damage, expenses, claims and costs (including legal costs on a indemnity basis) suffered and\/or incurred by PSA and\/or its Affiliates, employees, officers and agents (as the case maybe) arising out of or in connection with the Incubator Program, to the extent that such claim arises out of the failures, act(s), omission(s), negligence and\/or breach(s) by the Applicant.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"20\">\n<li>Any dispute or claim arising out of or relating to these Terms and Conditions or the Innovation Application connection shall be governed by and construed in accordance with the laws of the Republic of Singapore. The courts of Singapore shall have exclusive jurisdiction to settle any dispute or claim that arises out of or in connection with these Terms and Conditions.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"21\">\n<li>If any court or competent authority finds that any provision of these Terms and Conditions (or part of any provision) is void, invalid, illegal or unenforceable, that provision (or part-provision) shall, to the extent required, be deemed to be deleted, and the validity and enforceability of the other provisions of these Terms and Conditions (and, as the case may be, the remainder of the relevant provision) shall not be affected.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"22\">\n<li>PSA reserves the right to modify, amend, vary, add and\/or delete any of these Terms and Conditions with or without prior notice to the Applicant.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"23\">\n<li>A third party shall have no rights under the Contracts (Rights of Third Parties) Act (Cap. 53B), to enforce any of these Terms and Conditions.<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<ol start=\"24\">\n<li>These Terms and Conditions apply to all innovation applications submitted on or after 9 May 2016.<\/li>\n<\/ol>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Terms and Conditions for the PSA Incubator Program This document (hereafter referred to as &#8220;Terms and Conditions&#8220;) sets out the terms and conditions under which the Applicant agrees to submit its proposal (hereinafter referred to as the “Innovation Application”), and provide further information and\/or clarification, for the purposes of being considered for the PSA unboXed [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/unboxed.globalpsa.com\/wp-json\/wp\/v2\/pages\/474"}],"collection":[{"href":"https:\/\/unboxed.globalpsa.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/unboxed.globalpsa.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/unboxed.globalpsa.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/unboxed.globalpsa.com\/wp-json\/wp\/v2\/comments?post=474"}],"version-history":[{"count":0,"href":"https:\/\/unboxed.globalpsa.com\/wp-json\/wp\/v2\/pages\/474\/revisions"}],"wp:attachment":[{"href":"https:\/\/unboxed.globalpsa.com\/wp-json\/wp\/v2\/media?parent=474"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}